[
  {
    "path": "posts/welcome/",
    "title": "Welcome to Visual Analytics",
    "description": "Welcome to my new blog, Visual Analytics. I hope you enjoy \nreading!",
    "author": [
      {
        "name": "Gabriella Pauline Djojosaputro",
        "url": "https://github.com/gabriellapauline"
      }
    ],
    "date": "2021-01-29",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-31T11:12:13+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-29-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A data visualization makeover",
    "author": [
      {
        "name": "Gabriella Pauline Djojosaputro",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-29",
    "categories": [],
    "contents": "\r\n1. Introduction\r\nWe are living in a world that is constantly producing a vast amount of data, and data visualisation helps us to understand the data better. However, a poor visualisation can be of little value, or even misleading. Visual analytics is not just about creating a pretty chart, but it is the marriage of data analytics and visualizations that aims to detect the expected and discover the unexpected.\r\nThis post will makeover Chart 6: Resident Labour Force by age group from page 22 of Labour Force in Singapore 2019 Report.\r\n2. Original Visualization\r\nTo start, we examine the original visualisation from the data (Figure 1) to learn what we can improve. The critique is given in terms of clarity and aesthetics.\r\nFigure 1. Original chart from Labour Force in Singapore 2019 Report2.1 Clarity:\r\nPoor choice of chart gives the impression that they are comparing the distribution of age in two categories, for example the age distribution in male and female residents. To represent how values change over time, line chart is a better choice than histogram.\r\nIt is difficult to see the values of the data points in the chart. The graph does not have axis and thus we need to depend on the labels to see the actual value of each data point. However, these labels are put below the chart as a table, and not on the chart itself.\r\nThere is an inconsistency between the statement and the chart. While the statement mentions a decline in 25 - 54 age group as well as an increase in 55 & over age group, the readers are not able to find the values on the chart itself. These are a summation of multiple categories from the chart and the readers must manually sum the numbers together to get the the values mentioned in the statement.\r\nThe statement mentioned rise of Labour Force Participation Rate (LFPR) and population size per age group, but the chart also does not have any reference to LFPR or population size per age group.\r\n2.2 Aesthetics:\r\nThe chart is not exported in good quality. It is quite pixelated, even in the original report.\r\nUsing a very short subtitle ‘Per Cent’ creates an awkward empty space above the chart. It would be better to add it to the title, or omit the subtitle altogether.\r\nAlthough the report uses a white background, the chart has a grey background colour. Background colour is an unnecessary non data-ink which does not add value in helping to understand the data better.\r\n3. Alternative Graphical Representation\r\nFigure 2 shows the alternative graphical representation proposed for the makeover.\r\nFigure 2. Alternative Graphical RepresentationThe issues that the alternative design tries to overcome are:\r\nTo clearly show the difference of workforce distribution over time by the use of line chart instead of histogram.\r\nTo further categorise the age groups together to the same level as the point of interest in the statement, so that the readers can see the value directly without having to calculate the total from different subgroups.\r\nTo show the LFPR and population size per age group. This alternative representation will directly show the difference between 2019 and 2009 values instead of showing another line charts because they are just additional information.\r\nTo remove unnecessary non-data-ink by using a white background (Note: The colour on the proposed design is from the paper, which is not going to be used in the final chart).\r\n4. Step-by-Step Description\r\n4.1 Data Source\r\nThere is no visualisation and analytics if there is no data. The data that will be used are:\r\nNo\r\nData\r\nSource\r\n1.\r\nResident Labour Force by Age\r\nLabour Force 2019 Report, Table 7\r\n2.\r\nLabour Force Participation Rate by Age\r\nLabour Force 2019 Report, Table 5\r\n3.\r\nPopulation Size by Age\r\nSingapore Department of Statistics\r\n4.2 Resident Labour Force Line Chart\r\nThis chart will show how percentage of each age groups of interest in the Resident Labour Force changes through the course of 2009 to 2019. Steps to create the visualisation is shown below.\r\nData Preparation\r\nFigure 3. Connect to DataCreate a new workbook and click Connect to Data.\r\nChoose the file type > file name (In this case, it would be Table 7 from Labour Force Report 2019).\r\n! Figure 4. Add Table\r\nDrag the table that we want to the workspace. We are interested in the total number, not in the distribution of gender. Therefore, we can use T7_T that contains the total number of males and females.\r\nCheck the Use Data Interpreter checkbox to allow Tableau to do automatic cleaning. Tableau is able to intelligently detect valuable columns and rows, and drop the empty ones.\r\nFigure 5. Hide ColumnAfter the cleaning, we still have a column that we are not interested in. There are some values in the column, but it is just an annotation.\r\nHover to the column header that we want to hide.\r\nClick the grey inverted triangle > Hide.\r\nThe first row in the table has null in the Age column. This value is the total from all Age groups, which we can obtain with the SUM function later. We can filter out this row.\r\nFigure 6. Add FiltersIn the top right-hand corner, under Filters, click Add.\r\nClick Add again in the Edit Data Source Filters window.\r\nSelect the Age field > OK.\r\nFigure 7. Select AgeWe can either select None and manually check the data items we want one-by-one, or check all boxes first and unselect the one we do not want. Since we only want to remove one age group, we will do the latter.\r\nSelect All.\r\nUncheck the Null box > OK.\r\nThe table is currently in a wide format, but we want it to be long and thin so we can assign the years as a Date variable. We can use the pivot function from Tableau.\r\nFigure 8. PivotSelect all the columns with the year as the header column. We can do this by holding Ctrl button while selecting the columns or holding Shift button and select the first (2009) and last (2019) column that we want.\r\nRight-click on any of the column header > Pivot.\r\nFigure 9. Rename ColumnsThe data is now transformed to a thin table with three columns. The original column headers are stored in Pivot Field Names, while the values are stored in Pivot Field Values. Rename the columns to make it easier to understand.\r\nRight-click on the column header > Rename.\r\nThe original and new column names are shown below.\r\nOriginal Column Name\r\nNew Column Name\r\nPivot Field Names\r\nYear\r\nPivot Field Values\r\nResident Labour Force\r\nAge (Years) 2\r\nAge\r\nFigure 10. Change to DateNotice that there is an ‘Abc’ symbol above the column Age and Year. This means the two variables are considered String Variables. However, we want the Year to have a Date data type. * Click the ‘Abc’ symbol in Year column header > Date.\r\nFigure 11. Create GroupNext, one of the improvement we want to make on the original visualisation is to group the age variable so it will be the same as the age groups that are mentioned in the statement. Therefore, we need to group into 25 - 54 and 55 & over. Age group 15 - 24 will be created even though it is not mentioned in the statement to show that the numbers sum to 100%.\r\nRight-click on Age column header > Create Group…\r\nFigure 12. Age GroupsSelect the ages that we want to group together (e.g. 15 - 19 and 20 - 24), then press Group.\r\nEnter the appropriate group name.\r\nRepeat to get three age groups as shown in Figure 12 > OK.\r\nFigure 13. Create Calculated FieldThe current value that we have for Resident Labour Force is absolute value, but we are interested in the distribution of age in the workforce. We can get this value by doing a quick table calculation or creating calculated field. This post will use the latter method.We need to create two calculated fields: Total Resident Labour Force and Percentage of Total Resident Labour Force.\r\nRight-click on the Resident Labour Force column header > Create Calculated Field…\r\nFigure 14. Total Resident Labour Force FormulaThe formula shown above calculates the total number of people in the Resident Labour Force per year.\r\nEnter formula shown in Figure 14.\r\nEnter calculated field name name (I used ’Total Resident Labour Force).\r\nRepeat for Percentage of Total Resident Labour Force field using the following formula:\r\n\r\n[Resident Labour Force]/[Total Resident Labour Force]\r\n\r\nFigure 15. Go to SheetWe are done! We can go to the Sheet1 Tab in the bottom left-hand corner.\r\nCreating Visualisation\r\nSheet is where we can build visualisation. The general layout in Tableau interface is shown in Figure 16.\r\nFigure 16. Tableau LayoutWe can build visualisation by dragging the fields from the data pane directly to the canvast or to the shelves. Depending on where we drop the fields, they will take on different roles in the visualisation. To create the line chart for the Resident Labour Force by age group, we will drag the following fields to the column.\r\nFigure 17. Rows and Columns for Line ChartDrag Year to Columns shelf.\r\nDrag % of Total Resident Labour Force to Rows shelf.\r\nNotice that Tableau automatically recommends a line chart to visualise our data. Don’t be alarmed that it is only displaying a straight line. Right now it computes the total percentage of all group, that is why it is always 100%. Next, we need to separate the age groups.\r\nFigure 18. Add Age GroupDrag Age (group) to the Color Marks Card.\r\nCustomisation\r\nWe can further customise the chart appearance to enhance the usefulness and readability of the chart. There are several customisations on the line chart that we are going to perform.\r\nLabel\r\nFigure 19. Add LabelDrag % of Total Resident Labour Force to the Text Marks Card.\r\nDouble-click on Text Marks Card to open the settings.\r\nSelect Line Ends to make the labels only appear on the line end. Otherwise, the chart will be too cluttered.\r\nFigure 20. Format LabelRight-click on one of the labels > Format… to open the Format Pane.\r\nClick on Fields on the top right-hand corner of the Format Pane and click SUM(% of Total Resident Labour Force) that we used for the label.\r\nClick Numbers > Percentage to display the number in percentage form instead of decimal points.\r\nAxis / Header\r\nAs we have already labeled the data points of interest, the y-axis is no longer necessary. We can remove the axis to increase our data-ink ratio.\r\nFigure 21. Remove AxisRight-click on the y-axis > Uncheck Show Header.\r\nFigure 22. Hide Field Labels for ColumnsLikewise, right-click on Year header on the top of the chart > **Hide Field Labels for columns because the year is already quite self-explanatory.\r\nLine Markers\r\nFigure 23. Add MarkersClick on Color Marks Card and select All markers which is the middle option. This will make it easier to see the individual data points.\r\nTitle\r\nOur current default title is the sheet name, which is Sheet 1. We can change the sheet name, and further tailor the title to make it more informative.\r\nFigure 24. Rename Sheet NamePretty self-explanatory. Double-click on the Sheet 1 Tab below, then we can type in the desired name. I put ‘Singapore Resident Labour Force by Age Group’.\r\nFigure 25. Change Sheet TitleDouble-click on the sheet title.\r\nWrite the desired title. We can also adjust the font size and formatting.\r\n‘’ means the value is dynamic. Whenever the sheet name changes, the title will follow accordingly. We can also add other variables by clicking Insert. However, we are not adding other variables now.\r\nAnnotations\r\nWe can also annotate on the chart itself to highlight interesting findings.\r\nFigure 26. Annotate MarkRight-click on one of the data point > Annotate > Mark….\r\nFigure 27. AnnotationAdd findings that we want to highlight.\r\nJust like the sheet title, we can customise the annotation and make use of the variables using the Insert button. And now, we are done for this line chart! We can adjust the width and height of the chart by hovering to the right side or below the chart until our cursor turns into a double-sided arrow and drag accordingly.\r\nFigure 28. Final Look for Singapore Resident Labour Force Line Chart4.3. Labour Force Participation Rate Bar Chart\r\nNext, the statement mentions that the increase in older residents in Singapore Labour Force is due to the rise in Labour Force Participation Rate for older residents. We are going to visualise this data to support the statement. Some steps are the same as what was explained in the previous section.\r\nData Preparation\r\nFigure 29. Add New Data SourceGo back to the Data Source tab.\r\nClick the database icon (cylinder) next to the data source name > New Data Source .\r\nChoose the file type > select the file (Table 5 from Labour Force Report 2019).\r\nDrag the T5_T table.\r\nCheck Use Data Interpreter.\r\nHide the first column (F1).\r\nFigure 30. Add FiltersIf we scroll down and see the bottom of the data table, we can see that they have already grouped the age. Therefore, we can filter out the 5-year age bins on the top.\r\nClick Add below the word Filters on the top right-hand corner of the screen > Add.\r\nSelect the Age field (shown as Age(Years) 1 in my Tableau) > OK.\r\nOnly keep 15 - 24, 24 - 54, 55 - 64, and 65 & Over age groups.\r\nGroup the 55 - 64 and 65 & Over groups together and give 55 & Over as the group name.\r\nFigure 31. Live ConnectionThe spacing seem to be very wide for the age groups. Since we are using a live connection, any update on the data source will be reflected in Tableau. I opened the Excel file to manually fix the spacing.\r\nFigure 32. Labour Force Participation Rate Percentage Change FormulaAlthough this data is also in a wide format, we only need the difference between 2019 and 2009 data. We do not need to pivot the table, but we need to create a calculated field for the difference.\r\nRight0click on 2019 column > Create Calculated Field…\r\nEnter the formula shown in Figure 31.\r\nFigure 33. Add New WorksheetWe are done preparing the data. Now we can create the second chart on a new worksheet.\r\nClick on the New Worksheet icon. It is the tab directly next to our line chart tab.\r\nCreate Visualisation\r\nFigure 34. Rows and Columns for Labour Force Participation Rate Bar ChartFor the bar chart, we want to have 3 bars that show the change of Labour Force Participation Rate between 2009 and 2019.\r\nDrag Age group field to the Columns shelf.\r\nDrag Labour Force Participation Rate % Change field to the Rows shelf.\r\nCustomisation\r\nFirst, we are going to add the colour and label to make the bar chart easier to see.\r\nFigure 35. Add Colour and LabelDrag Labour Force Participation Rate % Change field to Color and Label Marks Card\r\nColour\r\nIf we see the color legend on the right, we can see that the range does not start from 0, it only uses the smallest and the biggest value. The purpose of changing the colour to to quickly highlight the positive and negative values as well as showing the significance of the change. Colour is a pre-attentive attribute, so we can quickly notice the difference in colour.\r\nFigure 36. Change ColourDouble-click on the colour legend.\r\nChoose Orange-Blue Diverging palette.\r\nSelect Use Full Color Range.\r\nClick Advanced.\r\nSet the color so it will diverge from the Center at 0.\r\nThe colour of the bars may not change now because all the values are positive. It is okay.\r\nLabel\r\nEven though the Labour Force Participation Rate % Change is a percentage, the number is not between 0 and 1. Therefore, we will use a slightly different method to display the ‘%’ sign.\r\nFigure 37. Customise LabelOpen the format pane like how we did it for the line chart.\r\nChange the Fields to SUM(Labour Force Participation Rate % Change)\r\nChoose Numbers > Numbers (Custom)\r\nReduce the Decimal places to 1\r\nAdd % in the Suffix\r\nNow that the bar is labeled, we can take away the unnecessary axis and headers using the same steps as in the previous section. Remember to rename the sheet name and put a proper title.\r\nFigure 38. Final Look for Labour Force Participation Rate Change4.4. Population Size Change Bar Chart\r\nThe steps to create the Population Size Change Bar Chart is exactly the same as the Labour Force, except we are using a different dataset and we are not displaying ‘%’ sign in the suffix.\r\nFigure 39. Final Look for Population Size Change Bar Chart4.5. Dashboard\r\nNow, it is time to combine the various charts that we have created.\r\nFigure 40. New DashboardTo create new dashboard, click the New Dashboard Tab, which is the second tab to the right of our last worksheet.\r\nFigure 41. Dashboard SizeAdjust the Size to your preference. Automatic means the size will adjust according to the device, but I found that using Automatic can cause problems in the alignment. I chose Desktop Browser(1000x800)\r\nFigure 42. Insert Sheet to DashboardTo add sheet to the dashboard drag the sheet name to the canvas.\r\nHold and hover around the dashboard to see a highlighted box, that will be the space that the sheet take up if we release our mouse.\r\nBy default, Tableau uses a Tiled layout. To better arrange our sheet, we can make use of the objects.\r\nFigure 43. Vertical ObjectVertical object allows us to have a vertical grid that we an fill in with sheets or another objects.\r\nDrag Vertical Object to the canvas.\r\nClick on the sheet that we already put to the dashboard.\r\nHover to the grey rectangle above the sheet until it turns to a four-sided arrow\r\nDrag the sheet into the vertical object\r\nSimilarly, we can use blank to add paddings around the objects (such as to align the sheets), add horizontal grid, text, etc.\r\nFigure 44. Remove LegendSince we have annotated the line chart and the colour in the bar charts are to highlight positive and negative values, the legends are not necessary.\r\nClick on the legend.\r\nClick on the cross to remove from the dashboard.\r\nFigure 45. Show Dashboard TitleTo create a title and lead-in for the dashboard, we can either use a Text object or use the dashboard title itself. The checkbox highlighted in Figure 45 will make the dashboard title appear.\r\nFigure 46. Final Dashboard LayoutThe final dashboard that I created is shown in Figure 46, marked with colour-coded rectangles to show what object I used to arrange them.\r\nCongratulations, we have completed our dashboard!\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-03T13:59:06+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
