[
  {
    "path": "posts/2021-02-12-dataviz-makeover-2/",
    "title": "DataViz Makeover 2 - COVID Vaccine Survey",
    "description": "Visualisation makeover for Likert Scale data and uncertainty.",
    "author": [
      {
        "name": "Gabriella Pauline Djojosaputro",
        "url": "https://www.linkedin.com/in/gabriellapauline/"
      }
    ],
    "date": "2021-02-12",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Original Visualisation Evaluation2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Alternative Graphical Representation\r\n4. Step-by-Step Description4.1. Data Preparation\r\n4.2. Diverging Stacked Bar Chart\r\n4.3. Dot Plot with Error Bars\r\n4.4. Dashboard\r\n\r\n5. Major Observations\r\n\r\n1. Introduction\r\nCOVID pandemic has impacted the world in unimaginable ways: work from home and zoom meetings are becoming norms; overseas travel almost comes to a complete halt; we might even start to forget that COVID confirmed cases and death are human beings, and not just numbers in a statistics. For the pandemic to be over, we need to achieve herd immunity either through recovery from infection or vaccine (Charumilind et al. 2021). However, despite being eager of seeing the end to this calamity, people might also have worries and beliefs that make them hesitant to take the vaccine.\r\nImperial College London Big Data Analytical Unit and YouGov (Jones and Sarah 2020) conducted a survey that measures the people’s behaviours in response to COVID-19. This data visualisation makeover will focus on the willingness of people in various countries to take the COVID vaccine.\r\n2. Original Visualisation Evaluation\r\nTo start, we examine the original visualisation from the data (Figure 1) to learn what we can improve. The critiques are given in terms of clarity and aesthetics.\r\nFigure 1. Original Visualisation2.1 Clarity\r\nTo keep:\r\nThe countries graphs are shown in a sorted order. The left graph is shown in alphabetical order, while the right graph is shown in a descending order.\r\nThe usage of colour is consistent between the two graphs. Both uses blue colour for strongly agree.\r\nThe axes and gridlines help the users to compare the values.\r\nTo be improved:\r\nAlthough the Likert Scale data is ordinal, the choice of colour does not show an inherent order. It would be better if a diverging colour scale is used, because the data has a meaningful central value, which is the neutral opinion (Yi 2019).\r\nBecause the survey is conducted on a sample of the population, the actual proportion in the population might not be exactly the same. Not visualising the uncertainty can mislead the users, and thus we need to show the range of possible values (Torres 2016).\r\nIt is hard to compare the actual proportion of people who picked 2, 3, or 4 in the Likert Scale because they do not have a common baseline.\r\nThe order of the countries are inconsistent between the two graphs.\r\nThe title of the legend is not informative.\r\n2.2 Aesthetics\r\nTo keep:\r\nThe chart has a nice font selection that is easy to read and not unnecessarily embellished.\r\nThe number of tick marks is just nice to allow comparison but not overly clutter the visualisation.\r\nThe two graphs are properly aligned.\r\nLabels have less colour intensity so they do not distract the users.\r\nTo be improved:\r\nThe choice of colours is too reliant on hue variation instead of value or chroma, hence increasing the visual clutter (Stone 2006). It is better to limit the colour palette to 2 or 3 hues and use variation of colour intensity to make the visualisation more aesthetically pleasing and functional.\r\nCountry names are not formatted properly. There is no capitalisation and there are dashes in the names.\r\nDecimal points are inconsistent in the axes. The left graph has no decimal points but the right one has 1 decimal points.\r\nLabels of the colour legend are inconsistent. Value 1 and 5 have a text explanation, while 2, 3, and 4 are just numbers.\r\n3. Alternative Graphical Representation\r\nFigure 2 shows the alternative graphical representation proposed for the makeover.\r\nFigure 2. Alternative Graphical RepresentationThe survey data uses a 5-point Likert scale for the respondents to rate the statements. There are multiple ways to visualise Likert scale data, such as a 100% stacked bar chart as in the original visualisation, multiple pie charts, diverging stacked bar chart, and so on (Pirrone 2020).\r\nDiverging stacked bar chart will help to compare the positive and negative sentiment more clearly, but there are multiple views of how to categorise neutral opinion. Having the middle of the neutral proportion as the center line makes it hard to compare the values because there is no common baseline (Wexler 2020). Therefore, the first part of the alternative design is a diverging stacked bar chart, in which we will split the neutral opinion and put it at the outermost part of the stacked bar.\r\nThe second part of the alternative design is a dot plot with error bar that indicates the confidence interval of the proportion. This will show the underlying variation in the data and prevent misleading the users (Wexler 2018).\r\nThe issues from the original visualisation that the alternative design tries to overcome is colour-coded in Figure 2, with orange numbers corresponding to critiques for clarity and blue numbers for critiques with regards to aesthetics.\r\nClarity:\r\nTo show an order in the survey response using a diverging colour scale.\r\nTo show the uncertainty using an error bar in the dot plot.\r\nTo allow the users to toggle between different response of interest. The users may choose to view individual percentage and error bars for ‘Strongly Agree’, ‘Agree’, ‘Neutral’, ‘Disagree’, and ‘Strongly Disagree’.\r\nTo sort the order of countries in both graphs consistently in descending manner according to the selected response of interest in the right graph.\r\nAesthetics:\r\nTo limit the colour palette and utilise a variation of colour intensity on top of differing hue.\r\nTo use proper capitalisation and formatting for the country name labels.\r\nTo standardise the axes labels to show no decimal points.\r\nTo label the colour legends consistently using a textual explanation.\r\nAdditional Features:\r\nTo allow the users to visualise different survey items. The users can see the response for questions such as whether the respondents are afraid of COVID vaccine side effects, not just restricted to whether or not they are willing to take the vaccine.\r\nTo use animation to show the transitions between different selected parameters, so the users can easily notice if the ranks of the countries change.\r\nThe final look of the data visualisation makeover is shown in Figure 3. It is also available in !!!!\r\nFigure 3. Data Visualisation Makeover 2 Final Look4. Step-by-Step Description\r\nIn this section, we are going through the steps to recreate the Data Visualisation Makeover shown in Figure 3 using Tableau. Tableau Desktop has a 14-day trial that can be downloaded here.\r\n4.1. Data Preparation\r\nData Source\r\nThe visualisation is based on the publicly available Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub, which aims to get insights or how people respond to COVID-19. They also publish a dashboard to visualise the data.\r\nData Cleaning\r\nAs the survey was done in a large scale and measures a wide variety of behavioural responses, there are a lot of columns that we do not need. Reducing the size of the dataset is necessary to speed up Tableau, and ensure we do not drown in the data ;)\r\nFigure 4. Connect to Data SourceCreate a New Workbook.\r\nClick Connect to Data.\r\nSelect the data type and browse to select any one of the csv (The data comes in multiple csv files, one for each country).\r\nFigure 5. Remove TableNext, we need to join all the files using the Union function from Tableau. Ensure the workspace has no tables to prevent errors when we join the csv files.\r\nRight-click on the table > Remove.\r\nFigure 6. Add New UnionDrag New Union to the workspace.\r\nFigure 7. Add All csv FilesWe can either drag all the tables listed in the Files column on the left or use the Wildcard tab.\r\nSelect Wildcard (automatic).\r\nEnter the wildcard in Include field: ‘*.csv’. This will include any files as long as they have ‘.csv’ at the end of the file name.\r\nClick OK.\r\nFigure 8. Hide Unused ColumnsBrace yourself, depending on your machine, the data cleaning part can take a long time for Tableau to process. DO NOT CLICK UPDATE NOW or AUTOMATICALLY UPDATE. Unless you want to stare at your Tableau and wait.\r\nTo reduce the dataset, we need to hide away all columns we are not using and export the smaller set. Do keep in mind that we can still remove away more even after exporting, but we need to go through this process again if we want to add more columns.\r\nHold Ctrl and select the columns we want to remove.\r\nRight-click > Hide.\r\nWe are interested in vac_1, vac2_1, vac2_2, vac2_3, vac2_6, and vac_3 survey items, as well as gender, age, household_size, household_children and employment_status contextual data.\r\nFigure 9. Go To WorksheetWhen we combine the files in a union, Tableau will add a column called Path or Table, depending on whether we used Wildcard or Specific method to add the files. We can rename and format this field, but it would be easier to do it later after we export the data subset.\r\nGo to Worksheet by clicking Sheet 1.\r\nFigure 10. View DataClick on Analysis menu at the top of the screen > View Data…\r\nFigure 11. Export Full DataClick on Full Data.\r\nBy default, we only get the first 10,000 rows. Since we want to get all rows, enter a large number in the number of rows. I entered 1,000,000 and it automatically gets all the rows available, which is 486,743 rows.\r\nExport all.\r\nSave the data.\r\nNow, we have a smaller dataset containing only the columns that we are interested in. Let’s process the file in a new workbook.\r\nCtrl + N\r\nRepeat steps to connect to the exported data.\r\nFigure 12. Edit AliasesTo improve the country name appearance, we are going to recode it.\r\nRight-click on Path column header > Aliases…\r\nEnter the appropriate country name in Value(Alias) column > OK.\r\nDouble-click on ‘Path’ column name to rename the column to ‘Country’.\r\nThe legend in the original visualisation is inconsistent because the survey item responses are stored in string, and only the value 1 and 5 have a descriptor for it. We are going to standardize the value as integer, so we need to get rid of the textual description by using a custom split.\r\nFigure 13. Custom SplitOn each column there are ‘Abc’ or ‘#’ symbol. ‘Abc’ means the column is a string, while ‘#’ means it is numerical. If the symbol starts with an equal sign, such as ‘=Abc’ or ‘=#’, it means the column is a calculated field. Ensure that the survey items are in a string format before doing the split. If they are not, click on the data type and change it to String.\r\nThe value for 1 is ‘1 - Strongly Agree’. Notice that the numerical value is the first part of the string before a space bar. Therefore, we will split the first column using the space bar as a separator.\r\nRight-click on one of the survey items’ column header (e.g. vac 1) > Custom Split…\r\nEnter a space bar in the separator\r\nEnsure we split off the First 1  column > OK\r\nFigure 14. Describe FieldWe can use describe field to check whether the split was done correctly.\r\nRight-click on the newly created column from the split > Describe Field…\r\nWe have the values from 1 to 5 now in the column, so we can convert the data type to number.\r\nFigure 15. Change Data TypeClick on the data type symbol > Number (whole)\r\nWe can also rename the column and hide the original column to make it cleaner. I added a suffix ‘- ori’ the original columns and used the original column names in the calculated columns.\r\nRepeat the steps from Figure 13 for all survey items, and we are ready to create the visualisation.\r\n4.2. Diverging Stacked Bar Chart\r\nCreating Visualisation\r\nWe will need make use of parameters to allow the users to dynamically change the survey items being displayed.\r\nFigure 16. Create Parameter for Survey ItemGo to worksheet.\r\nRight-click on an empty space in the data pane > Create Parameter…. Tableau can be a bit picky about this, the ‘Create Parameter’ option does not show if you accidentally click on a field name. I found that the best place to click is just below the Measure Values.\r\nEnter ‘Select Survey Item’ as name for the parameter.\r\nChange data type to String.\r\nSelect List for allowable values.\r\nEnter the list of values. I used the column names (vac_1, vac2_1, vac2_2, vac2_3, vac2_6, and vac_3) for the value and the survey questions for the display as. Refer to /covid-19-tracker/codebook.xlsx to get the survey questions.\r\nclick OK.\r\nFigure 17. Create Calculated FieldsWe will need several calculated fields to enable the visualisation. The steps to create a calculated fields are: * Right-click on an empty space in the data pane > Create Calculated Field…. * Enter the field name and the formula.\r\nThe formulas that we need for the diverging stacked bar chart are:\r\nNumber of Records:\r\n1\r\nSelected Survey Item:\r\nCASE [Select Survey Item] when ‘vac1’ then [Vac 1] when ‘vac2_1’ then [Vac2 1] when ‘vac2_2’ then [Vac2 2] when ‘vac2_3’ then [Vac2 3] when ‘vac2_6’ then [Vac2 6] when ‘vac3’ then [Vac 3] end\r\nCount Positive:\r\nIf [Selected_Survey_Item] < 3 then 1 elseif [Selected_Survey_Item] = 3 then 0.5 else 0 END\r\nCount Negative:\r\nIf [Selected_Survey_Item] > 3 then -1 elseif [Selected_Survey_Item] = 3 then -0.5 else 0 END\r\nTotal Count: TOTAL(SUM([Number of Records]))\r\nPositive Percentage:\r\nSUM([Count Positive]) / [Total Count]\r\nNegative Percentage:\r\nSUM([Count Negative]) / [Total Count]\r\nWe create the visualisation by adding fields to the rows and columns shelves, as well as the filters and marks cards. Figure 18 shows the first cut of the visualisation.\r\nFigure 18. Specify Rows and Columns FieldsTo get to this stage, the steps are:\r\n** Drag Negative Percentage and Positive Percentage to Columns. ** Drag Country to Rows. * We are not interested in the average or sum of the survey response, but we are going to treat is a category that describes the responses. Therefore, we need to convert it to a dimension by doing right-click on the Selected_Survey_Item field in the data pane > Convert to Dimension. * Drag ** Drag Negative Percentage and Positive Percentage to Columns. * Drag Selected_Survey_Items to Color Marks Card. * Drag Selected_Survey_Items to Filters Card and select All, then uncheck Null to remove all null responses.\r\nFigure 19. Edit Colour LegendThe visualisation is not completed yet, but I found it confusing to look at when the colour seem randomly chosen and the legend are not informative. We are going to stop a while to fix the legend before continuing.\r\nRight-click on the legend label > Edit Alias…. We know that 1 signifies ‘Strongly Agree’ while 5 stands for ‘Strongly Disagree’. So we enter the descriptions accordingly for 2, 3, and 4 as well.\r\nFigure 20. Select Colour for Each ResponseDouble-click on the colour legend to open the edit color window.\r\nSelect the colours. I used the Color Blind palette to ensure that the visualisation can be understood clearly, as ten percent of men has red-green colour-blindness (Shaffer, n.d.). Shades of blue colour are used to represent positive responses while shades of red are used to represent the negative sentiment.\r\nFigure 21. Compute Using Selected_Survey_ItemNotice that in Figure 18, the negative and positive percentage for each country do not add up to 100% and Israel has the smallest bar compared to other countries. To rectify this issue, ensure the percentages are computed based on the selected survey item.\r\nRight-click on Negative Percentage pill on the columns shelf > Compute Using > Selected_Survey_Item.\r\nRepeat for Positive Percentage.\r\nFigure 22. Use Dual AxisAlthough the percentages add up to 100% now, but they are actually plotting the positive and negative percentages side by side with a different axis scale. We will use dual axis to standardise the two axis.\r\nRight-click on Positive Percentage pill on the column shelf > Dual Axis.\r\nDon’t panic if your visualisation suddenly goes haywire. Click All Marks Card then change the visualisation type from Automatic to Bar.\r\nRight-click on the Positive Percentage Axis > Synchronize Axis.\r\nWe can get back the original colour we have chosen by removing the Measure Names from the colour marks card. We can drag the Measure Names field off from the Marks Card. Ensure we are still selecting the All Marks Card while doing so.\r\nFigure 23. Reorder ColoursPreviously, neutral bars are drawn first for the Positive Percentage. We can rearrange the bars by manually reordering the colour in the colour legend.\r\nDrag Neutral colour to the top.\r\nSwap the order between Strongly Agree and Agree.\r\nThis creates an unintuitive order for the colour legend, but it is fine. We will not use this legend in the final dashboard.\r\nCustomisation\r\nWe can do some final touch up to customise how our visualisation looks like. For a more detailed steps to change each of the elements, take a look at my first dataviz makeover post.\r\nAxis\r\nFigure 24. Edit Axis TitleFor the axis, we are going edit the title and format the numbers.\r\nRight-click on the Negative Percentage axis > Edit Axis…\r\nChange the Title to Proportion.\r\nRemove the top axis by doing right-click on the Positive Percentage axis > uncheck Show Header\r\nFigure 25. Edit Axis Number FormatRight-click on the axis > Format…\r\n\r\nClick Axis > Numbers > Percentage.\r\nUse 0 decimal points.\r\nRepeat for the top axis. I chose to leave it inside instead of removing it because it might be easier to see since we have numerous countries.\r\nTitle\r\nRemember the parameter we created earlier? We are going to use the questions as the title.\r\nFigure 26. Edit TitleDouble-click on the title.\r\nInsert > Parameters.SelectSurveyItem > OK.\r\nWe can show the parameter to check. Go to the data pane, right-click on the Select Survey Item > Show Parameter. We can toggle the different survey items we want to see and the visualisation will change accordingly.\r\nFilters\r\nHaving filters allow the users to interact with the visualisation and tailor it according to their needs. We will use Employment Status, Gender, Age, Household Children and Household Size fields as the filters.\r\nFigure 27. Add String FiltersDrag Employment Status to the Filters.\r\nClick All > OK.\r\nRight-click on the Employment Status pill in the filter card > Show Filter.\r\nRepeat for Gender.\r\nFigure 28. Add Numeric FiltersFor the numeric filter, the interface is slightly different because we can pick a range of values.\r\nDrag Household Size to the Filters.\r\nAll values > Next.\r\nCheck include null values > OK. This might dilute the information because the nulls will still be included when we want to examine by a certain household size, but filtering out the nulls can cause us to lose a significant subset of data. For this trade-off, I chose to include the nulls.\r\nRight-click on the Household Size pill in the filter card > Show Filter.\r\nRepeat for Household Children and Age.\r\nFigure 29. Diverging Stacked Bar ChartOne down, one more to go!\r\n4.3. Dot Plot with Error Bars\r\nCreating Visualisation\r\nThe dot plot will visualise the selected response (e.g. Strongly Agree) for the selected survey item in the diverging stacked bar chart. We also need to repeat the steps to create parameters and calculated fields, but with some adjustments.\r\nFigure 29. Create Parameter for ResponseUse integer data type because the survey response values will be in the range of 1 to 5. We will match the value chosen from the parameter with the Selected_Survey_Item value.\r\nEnter number 1 to 5 for value and the textual descriptions in ‘Display As’ column.\r\nAdditionally, we can add a total for agree and strongly agree as well as disagree and strongly disagree. Use 0 for ‘Agree and Strongly Agree’, and 6 for ‘Disagree and Strongly Disagree’.\r\nThe formulas we need to add for the dot plot are:\r\nCount Selected Response:\r\nIf [Selected_Survey_Item]=[Select Response] Then 1 elseif [Select Response] = 6 Then if [Selected_Survey_Item] = 4 or [Selected_Survey_Item] = 5 then 1 else 0 end elseif [Select Response] = 0 then if [Selected_Survey_Item] = 1 or [Selected_Survey_Item] = 2 then 1 else 0 end else 0 End\r\nProp:\r\nTOTAL(SUM([Count Selected Response]))/ [Total Count]\r\nProp 95% Lower Limit%:\r\n[Prop] - 1.959964 * sqrt([Prop]*(1-[Prop])/[Total Count])\r\nProp 95% Upper Limit%:\r\n[Prop] + 1.959964 * sqrt([Prop]*(1-[Prop])/[Total Count])\r\nProp 99% Lower Limit%:\r\n[Prop] - 2.575829 * sqrt([Prop]*(1-[Prop])/[Total Count])\r\nProp 99% Upper Limit%:\r\n[Prop] + 2.575829 * sqrt([Prop]*(1-[Prop])/[Total Count])\r\nDot Plot\r\nWe are going to start by creating the dots for the proportion from the sample.\r\nFigure 30. First Cut of the Dot PlotPut Prop in the **Columns.\r\nPut Country for the Rows.\r\nFilter out all null values in the Selected Survey Item.\r\nChange mark from Automatic to Circle.\r\nAdjust the size of the dots to your liking.\r\nShow Parameter so we can toggle and check if it is working properly.\r\nIf the dots are in the same value for all countries, make sure that Prop is computed using cell.\r\nI found a neat trick that we can select Fit Height above the column shelf to automatically adjust the height of the chart.\r\nFigure 31. Edit ColourDrag Select Response to the Color Marks Card.\r\nDouble-click on the colour legend\r\nUse Orange-Blue Diverging palette\r\nCreate a 5 steps reversed palette. We need to reverse the colours because 1 indicates a positive opinion and we want it to be represented with blue colour. By default it will use red shades for the lower value because usually the lower values are negative and we want them to be red.\r\nAs we only select one response at a time, we need to create the range of values manually. Click Advanced > specify Start and End.\r\nYou can play around and see how the colour of the dots changes according to the selected response.\r\nFigure 32. Add LabelsAdd a label value for each of the dots by dragging Prop to the Label Marks Card.\r\nDouble-click on the Label Marks Card > Adjust Font and Alignment. The reason why Font appears blank is because it shows the preview of the text, and I chose white colour so we cannot see it. I used Tableau Bold 8pt.\r\nFormat the number appearance by doing right click on the labels > Format…\r\nChange the number format for both Axis and Pane to Percentage with 0 decimal places.\r\nWe can adjust the circle size again if we need to, but try not to make it very big, otherwise the circles will get cropped.\r\nError Bars\r\nFigure 33. Add Measure ValuesAdd Measure Values to the Columns.\r\nRemove away all fields from the Measure Values shelf, only retain Prop 95% Lower Limit, Prop 95% Upper Limit,Prop 99% Lower Limit, Prop 99% Upper Limit.\r\nClick the Measure Values Marks Card and remove all fields.\r\nChange the Marks Type to Line.\r\nWhy is the line going zig-zag like a drunk driver? Because we have not specified the path for the lines.\r\nFigure 34. Add Colour and PathDrag Measure Names to Colour and Path.\r\nTableau draw the line one on top of the other with respect to the order in the Measure Values. We need to reorder it so the 95% confidence interval (CI) will be drawn on top of 99% CI, otherwise we will not be able to see it. Reorder the fields in Measure Values so that 99% is above 95%.\r\nChange the colour by double-clicking on the legend. Use a lighter shade for 99% CI and a darker shade for 95% CI.\r\nFigure 35. Dual AxisCombine the circle and the confidence interval by using a dual axis.\r\nRight-click on the Prop pill on the Columns shelf > Dual Axis.\r\nRight-click on one of the axis scale > Synchronize Axis.\r\nEnsure Measure Values comes before Prop so the circle will be on top. If it is not, swap the order.\r\nTo tidy up the visualisation, edit the format of the axis scale to show percentage and hide the scale on the top.\r\nSort\r\nTableau does not allow sorting using a blended measure, so we need to use a workaround (Tableau, n.d.). We want to sort according to the order of Prop, so we will use it in the Rows shelf and hide it away.\r\nFigure 36. Add Prop to Columns and Convert to DiscreteDrag Prop to Rows shelf > right-click > Discrete\r\nFigure 37. Sort by PropMove Prop pill to before Country. Now it will automatically sort the values based on Prop.\r\nRight-click on the Prop header > Sort Descending.\r\nUncheck Show Header for Prop.\r\nFigure 38. Remove GridlinesIf your visualisation becomes cluttered with gridlines when you added Prop, you can remove them.\r\nRight-click anywhere on the chart > Format.\r\nChoose the grid icon > Rows > Change Row Divider to None.\r\nRepeat for Column.\r\nFigure 39. Edit Title for Dot Plot with Error BarLast but not least, edit the title so it will change dynamically according to the parameter selected by the users.\r\nFigure 40. Dot Plot with Error Bars4.4. Dashboard\r\nNow we are going to combine the two charts together in a dashboard, but we might still need to go back and adjust a few things in the chart.\r\nFigure 41. Dashboard Initial LayoutChoose the Power Point (1600 x 900) size.\r\nDrag Horizontal object to the workspace so the charts can be organized properly. We want them to be side by side.\r\nDrag Diverging Stacked Bar Chart from the Sheets pane to the workspace.\r\nDrag Dot Plot with Error Bars from the Sheets pane to the workspace, on the right side of the bar chart.\r\nDoes something look weird? Yes, we have not sorted the bar chart according to the order of the countries on the dot plot. Go back to the Diverging Stacked Bar Chart Sheet and repeat the steps to sort the countries according to Prop. Don’t panic if it suddenly becomes an even grid, just ensure the Negative and Positive Percentage are still computed using Selected_Survey_Item.\r\nFigure 42. Apply Filter to All SheetsBefore removing the country column for the dot plots, we need to make sure that the sorting works properly and the order of the countries in the two charts are identical. But they are not. This is because the diverging stacked bar chart has filters applied on it, but not the dot plot with error bars. So, we need to apply the filter to all sheets to standardise the sorting order.\r\nRight-click on the filter > Apply to Worksheets > All Using This Data Source.\r\nGo back to Dot Plot with Error Bars  > Uncheck Show Header for Country in the Rows shelf.\r\nWhile we are here, we probably need to add a blank line in the title so it will be aligned when the other chart has a longer title. Go back to the Dashboard.\r\nNotice that Figure 42 shows that we have the options to use single value or multiple values for the filter. I changed the type for Gender filter to be Single Value (list) because there already an option for all genders.\r\nFigure 43. Reorder Parameters and FiltersAdd another Horizontal object between the chart and the dashboard title.\r\nMove the Select Survey Item parameter to above the diverging stacked bar chart, and move the Select Response parameter to above the dot plot with error bars. To move a filter or parameter, click on it and drag the grey rectangle.\r\nRemove the Measure Names, Select Response, and Selected_Survey_item legends by clicking the cross mark.\r\nFigure 44. Add BlanksTableau does not allow us to easy adjust the size of the objects on the dashboard. We can use the workaround to add blanks to add some paddings.\r\nDrag Blank object to the areas marked on Figure 44. This will give space between the two charts and adjust the size of the Select Response Parameter so it will be aligned with the dot plot.\r\nCustomise the Dashboard title.\r\nCreate a Customised Legend\r\nIt looks almost complete, but the colour legend is still missing. Because we have to manually order the colour legends for the diverging stacked bar chart, now we need to create a customised legend in a new sheet.\r\nFigure 45. Add Colour to LegendCreate a New Sheet\r\nAdd Selected_Survey_Item to the Rows and Colour.\r\nChange mark type to Square.\r\nFilter out null values from the Selected_Survey_Item.\r\nIt looks quite nice, except the labels are on the left side. We will need a new calculated field to add the label. Create Calculated Field with the following formula.\r\nLabel:\r\nCASE [Selected_Survey_Item] WHEN 1 then ‘Strongly Agree’ WHEN 2 then ‘Agree’ WHEN 3 then ‘Neutral’ WHEN 4 then ‘Disagree’ WHEN 5 then ‘Strongly Disagree’ END\r\nFigure 46. Add Label to LegendDrag Label to the Label Marks Card.\r\nDouble-click on the Columns shelf > type ‘max(.1)’. This will create a formula that results in a constant of 1. The value is automatically labeled for us.\r\nFigure 47. Edit AxisWe just need to do a few more minor touch ups.\r\nResize the chart smaller by hovering to the right end of the chart until a double-sided arrow appears > drag to the left.\r\nDouble-click on the x-axis > specify the Fixed start and Fixed end.\r\nUncheck Show Header for AGG(max(.1)).\r\nFigure 48. Add Legend to DashboardDrag the Legend sheet to the top of filters in the right-most column.\r\nClick on the inverted triangle > Uncheck Title. Later we are going to add a text object for the title instead.\r\nAdjust the size to Fit Width.\r\nRemove the default colour legend that comes with the legend sheet.\r\nFigure 49. Add Text ObjectAdd a text object to the top of the legend to create a legend title. I used a bolded Tableau Medium 9 pt.\r\nClick on the inverted triangle > Floating\r\nTry to align with the filter titles.\r\nAlso add another text object to the bottom of the dashboard to include the data source.\r\nIn the round of final check, I just realised that age filter was not shown all this while. It is fine, we are human. We make mistakes. If you also forgot some filters, it is not too late to add them in.\r\nFigure 50. Add Age FilterClick on the diverging stacked bar chart where we added the age filter.\r\nClick on the inverted triangle > Filter > Age.\r\nDon’t forget to apply the filter to all worksheets.\r\nReorganise the order of the filters.\r\nFigure 51. Add AnimationsFor a final touch, since this visualisation is interactive, we can add animation so the users can see the changes of rank between countries when they change a parameter or a filter.\r\nClick on Format menu > Animations.\r\nTurn animations On and set the Duration. I used a Custom value of 0.75.\r\nFigure 51. Final DashboardCongratulations, we are done!\r\n5. Major Observations\r\nSome major insights were obtained from the alternative design of the COVID Vaccine Survey.\r\na. People are more willing to be vaccinated a year from now than this week due to worries for COVID vaccine potential side effects\r\nWe can clearly see the dominance of positive sentiment in the the willingness to be vaccinated a year from now (Figure 52), but the same thing does not apply to the willingness to be vaccinated this week (Figure 53).\r\nFigure 52. Proportion of People Willing To Be Vaccinated a Year from NowFigure 53. Proportion of People Willing To Be Vaccinated This WeekThis can be due to the worries of potential side effects for the COVID vaccine. Naturally, giving more time would allow the researchers to examine the side effects for COVID vaccine more carefully. The top 3 countries with the highest total proportion that agree to be vaccinated this week (Figure 54) is the same as the top 3 countries that are not worried about COVID vaccine side-effects (Figure 55).\r\nFigure 54. Top 3 countries with Highest Proportion That Agrees to be Vaccinated This WeekFigure 55. Top 3 Countries with Highest Proportion That Are Not Worried About COVID Vaccine Potential Side Effectsb. Older people are more worried about getting COVID-19 and more willing to be vaccinated this week\r\nSimilarly, by observing the division of sentiment regarding willingness to be vaccinated this week in the older people and the younger generation, we can see that the dominance for positive sentiment is higher in the older people (Figure 56) compared to the younger ones (Figure 57).\r\nFigure 56. Proportion of Older People Willing to be Vaccinated This WeekFigure 57. Proportion of Younger People Willing to be Vaccinated This WeekAlthough not as prominent, the proportion of people who are not worried about getting COVID-19 is also higher in the younger generation (Figure 58) than the older ones (Figure 59).\r\nFigure 58. Proportion of Younger People Not Worried About Getting COVID-19Figure 59. Proportion of Older People Not Worried About Getting COVID-19c. Countries with Highest Proportion that Worries about Getting COVID-19 Are Also Worried about the Side Effect of Vaccine\r\nFigure 60. Top 3 Countries with Highest Proportion That Worries about Getting COVID-19The significant difference between Japan, Spain, and South Korea to the other countries in terms of proportion that agrees to being worried of getting COVID-19 is interesting to observe. There is a very large gap to the next ranking country, Singapore, and even the 99% confidence interval do not overlap with any of the other countries.\r\nAnother survey item is phrased in a similar way, and the same 3 countries are in the group that shows a significantly higher worry than the other countries. \r\nThe top 5 countries with highest proportion that worries about the potential side effect of COVID-19 virus are Japan, Singapore, France, Spain, and South Korea. Again, there is no overlap in the confidence interval for the proportions.\r\nIt is possible that this observation is due to a higher anxiety level in the countries in general. Therefore, the people may be worried about everything, whether it is getting COVID-19, the side effect of COVID-19 vaccine, or whether they can get promotion, get married, remembered to feed their fish, and whether they have locked the door and turn off the stove.\r\nThis must be further investigated, so the common factor between these countries can be determined.\r\n\r\n\r\n\r\nCharumilind, Sarun, Matt Craven, Jessica Lamb, Adam Sabow, and Matt Wilson. 2021. “When Will the Covid-19 Pandemic End?” McKinsey &Amp; Company. McKinsey &amp; Company. https://www.mckinsey.com/industries/healthcare-systems-and-services/our-insights/when-will-the-covid-19-pandemic-end.\r\n\r\n\r\nJones, and P Sarah. 2020. “Imperial College London Yougov Covid Data Hub.” GitHub. Imperial College London Big Data Analytical Unit and YouGov Plc. 2020. https://github.com/YouGov-Data/covid-19-tracker.\r\n\r\n\r\nPirrone, Alana. 2020. “Seven Different Ways to Display Likert Scale Data.” Medium. https://medium.com/nightingale/seven-different-ways-to-display-likert-scale-data-d0c1c9a9ad59.\r\n\r\n\r\nShaffer, Jeffrey. n.d. “5 Tips on Designing Colorblind-Friendly Visualizations.” Tableau. https://www.tableau.com/about/blog/2016/4/examining-data-viz-rules-dont-use-red-green-together-53463.\r\n\r\n\r\nStone, M. 2006. “Choosing Colors for Data Visualization.” Perceptual Edge. http://www.perceptualedge.com/articles/b-eye/choosing_colors.pdf.\r\n\r\n\r\nTableau. n.d. “Sorting by Field Is Unavailable for Data Blended Measures: Tableau Software.” Sorting by Field Is Unavailable for Data Blended Measures | Tableau Software. Tableau. https://kb.tableau.com/articles/issue/sorting-by-field-unavailable-for-data-blended-measures.\r\n\r\n\r\nTorres, Nicole. 2016. “Why It’s so Hard for Us to Visualize Uncertainty.” Harvard Business Review. https://hbr.org/2016/11/why-its-so-hard-for-us-to-visualize-uncertainty.\r\n\r\n\r\nWexler, Steve. 2018. “Showing Uncertainty in Survey Results.” Data Revelations. https://www.datarevelations.com/resources/showing-uncertainty/.\r\n\r\n\r\n———. 2020. “Rethinking the Divergent Stacked Bar Chart - Placing the Stronger Views in the Center.” Data Revelations. https://www.datarevelations.com/resources/rethinkingdivergent/.\r\n\r\n\r\nYi, Michael. 2019. “How to Choose the Colors for Your Data Visualizations.” Medium. https://medium.com/nightingale/how-to-choose-the-colors-for-your-data-visualizations-50b2557fa335.\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-12-dataviz-makeover-2/./images/3. Final Look for COVID-19 Vaccine Survey DataViz Makeover.png",
    "last_modified": "2021-02-28T19:11:19+08:00",
    "input_file": {},
    "preview_width": 1806,
    "preview_height": 1015
  },
  {
    "path": "posts/2021-01-29-dataviz-makeover-1/",
    "title": "DataViz Makeover 1 - Singapore Labour Force",
    "description": "A data visualization makeover and a Tableau tutorial for beginners.",
    "author": [
      {
        "name": "Gabriella Pauline Djojosaputro",
        "url": "https://www.linkedin.com/in/gabriellapauline/"
      }
    ],
    "date": "2021-01-30",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Original Visualisation Evaluation2.1 Clarity\r\n2.2 Aesthetics\r\n\r\n3. Alternative Graphical Representation\r\n4. Step-by-Step Description4.1 Data Source\r\n4.2 Resident Labour Force Line Chart\r\n4.3. Labour Force Participation Rate Bar Chart\r\n4.4. Population Size Change Bar Chart\r\n4.5. Dashboard\r\n\r\n5. Major Observations\r\n\r\nThis will be quite a long post, so feel free to jump to the section that you are interested in.\r\n1. Introduction\r\nWe are living in a world that is constantly producing a vast amount of data, and data visualisation helps us to understand the data better. However, a poor visualisation can be of little value, or even misleading. Visual analytics is not just about creating a pretty chart, but it is the marriage of data analytics and visualizations that aims to detect the expected and discover the unexpected.\r\nThis post will makeover Chart 6: Resident Labour Force by age group from page 22 of Labour Force in Singapore 2019 Report.\r\n2. Original Visualisation Evaluation\r\nTo start, we examine the original visualisation from the data (Figure 1) to learn what we can improve. The critiques are given in terms of clarity and aesthetics.\r\nFigure 1. Original chart from Labour Force in Singapore 2019 Report2.1 Clarity\r\nTo keep:\r\nUsage of colours are consistent. All 2009 data uses grey colour, while 2019 data uses blue.\r\nUseful annotations such as reference lines and labels for the median are added.\r\nSource of the data is listed.\r\nTo be improved:\r\nPoor choice of chart gives the impression that they are comparing the distribution of age in two categories, for example the age distribution in male and female residents. To represent how values change over time, line chart is a better choice than histogram.\r\nIt is difficult to see the values of the data points in the chart. The graph does not have axis and thus we need to depend on the labels to see the actual value of each data point. However, these labels are put below the chart as a table, and not on the chart itself.\r\nThe only place where it is mentioned that the values are in percentage is in the subtitle, which is also in an awkward place. It might be better to use the ‘%’ suffix in the value labels.\r\nThere is an inconsistency between the statement and the chart. While the statement mentions a decline in 25 - 54 age group as well as an increase in 55 & over age group, the readers are not able to find the values on the chart itself. These are a summation of multiple categories from the chart and the readers must manually sum the numbers together to get the the values mentioned in the statement.\r\nThe statement mentioned rise of Labour Force Participation Rate (LFPR) and population size per age group, but the chart also does not have any reference to LFPR or population size per age group.\r\n2.2 Aesthetics\r\nTo keep:\r\nThe choice of colours are easy on the eye and looks elegant.\r\nThe chart has a nice font selection that is easy to read and not unnecessarily embellished.\r\nThere is no distracting grid lines.\r\nTo be improved:\r\nThe chart is not exported in good quality. It is quite pixelated, even in the original report.\r\nUsing a very short subtitle ‘Per Cent’ creates an awkward empty space above the chart. It would be better to add it to the title, or omit the subtitle altogether.\r\nAlthough the report uses a white background, the chart has a grey background colour. Background colour is an unnecessary non data-ink which does not add value in helping to understand the data better.\r\n3. Alternative Graphical Representation\r\nFigure 2 shows the alternative graphical representation proposed for the makeover.\r\nFigure 2. Alternative Graphical RepresentationThe issues that the alternative design tries to overcome are:\r\nTo clearly show the difference of workforce distribution over time by the use of line chart instead of histogram.\r\nTo further categorise the age groups together to the same level as the point of interest in the statement, so that the readers can see the value directly without having to calculate the total from different subgroups.\r\nTo show the LFPR and population size per age group. This alternative representation will directly show the difference between 2019 and 2009 values instead of showing another line charts because they are just additional information.\r\nTo add % suffix in the value labels.\r\nTo remove unnecessary non-data-ink by using a white background (Note: The colour on the proposed design is from the paper, which is not going to be used in the final chart).\r\nAdditionally, the visualisation will include title and lead-in that highlight the important observations, as well as maintaining the good points from the original charts, such as the choice of fonts and colours.\r\nUpdate:\r\nFigure 3. Alternative Graphical Representation UpdateAs the visualisation is being created, there are some slight deviations from the original plan. The changes are as the following:\r\nI could not find a way to remove the gridlines and rotate the y-axis labels if I create a trellis chart. Therefore, I decided to create 2 separate bar charts instead, but I will maintain the order of the age groups.\r\nAnnotations added to the line chart to reduce awkward empty spaces.\r\nThe two supporting charts are placed directly next to the line chart so it will look more coherent.\r\nThe final look of the data visualisation makeover is shown in Figure 4. It is also available in Tableau Public.\r\nFigure 4. Data Visualisation Makeover 1 Final Look4. Step-by-Step Description\r\nIn this section, we are going through the steps to recreate the Data Visualisation Makeover shown in Figure 4 using Tableau. Tableau Desktop has a 14-day trial that can be downloaded here. The steps might be too detailed, but they are designed so that beginners with no Tableau experience can follow the tutorial easily.\r\n4.1 Data Source\r\nThere is no visualisation and analytics if there is no data. The data that will be used are:\r\nNo\r\nData\r\nSource\r\n1.\r\nResident Labour Force by Age\r\nLabour Force 2019 Report, Table 7\r\n2.\r\nLabour Force Participation Rate by Age\r\nLabour Force 2019 Report, Table 5\r\n3.\r\nPopulation Size by Age\r\nSingapore Department of Statistics\r\n4.2 Resident Labour Force Line Chart\r\nThis chart will show how percentage of each age groups of interest in the Resident Labour Force changes through the course of 2009 to 2019. Steps to create the visualisation is shown below.\r\nData Preparation\r\nFigure 5. Connect to DataCreate a new workbook and click Connect to Data.\r\nChoose the file type > file name (In this case, it would be Table 7 from Labour Force Report 2019).\r\nFigure 6. Add TableDrag the table that we want to the workspace. We are interested in the total number, not in the distribution of gender. Therefore, we can use T7_T that contains the total number of males and females.\r\nCheck the Use Data Interpreter checkbox to allow Tableau to do automatic cleaning. Tableau is able to intelligently detect valuable columns and rows, and drop the empty ones.\r\nFigure 7. Hide ColumnAfter the cleaning, we still have a column that we are not interested in. There are some values in the column, but it is just an annotation.\r\nHover to the column header that we want to hide.\r\nClick the grey inverted triangle > Hide.\r\nThe first row in the table has null in the Age column. This value is the total from all Age groups, which we can obtain with the SUM function later. We can filter out this row.\r\nFigure 8. Add FiltersIn the top right-hand corner, under Filters, click Add.\r\nClick Add again in the Edit Data Source Filters window.\r\nSelect the Age field > OK.\r\nFigure 9. Select AgeWe can either select None and manually check the data items we want one-by-one, or check all boxes first and unselect the one we do not want. Since we only want to remove one age group, we will do the latter.\r\nSelect All.\r\nUncheck the Null box > OK.\r\nThe table is currently in a wide format, but we want it to be long and thin so we can assign the years as a Date variable. We can use the pivot function from Tableau.\r\nFigure 10. PivotSelect all the columns with the year as the header column. We can do this by holding Ctrl button while selecting the columns or holding Shift button and select the first (2009) and last (2019) column that we want.\r\nRight-click on any of the column header > Pivot.\r\nFigure 11. Rename ColumnsThe data is now transformed to a thin table with three columns. The original column headers are stored in Pivot Field Names, while the values are stored in Pivot Field Values. Rename the columns to make it easier to understand.\r\nRight-click on the column header > Rename.\r\nThe original and new column names are shown below.\r\nOriginal Column Name\r\nNew Column Name\r\nPivot Field Names\r\nYear\r\nPivot Field Values\r\nResident Labour Force\r\nAge (Years) 2\r\nAge\r\nFigure 12. Change to DateNotice that there is an ‘Abc’ symbol above the column Age and Year. This means the two variables are considered String Variables. However, we want the Year to have a Date data type. * Click the ‘Abc’ symbol in Year column header > Date.\r\nFigure 13. Create GroupNext, one of the improvement we want to make on the original visualisation is to group the age variable so it will be the same as the age groups that are mentioned in the statement. Therefore, we need to group into 25 - 54 and 55 & over. Age group 15 - 24 will be created even though it is not mentioned in the statement to show that the numbers sum to 100%.\r\nRight-click on Age column header > Create Group…\r\nFigure 14. Age GroupsSelect the ages that we want to group together (e.g. 15 - 19 and 20 - 24), then press Group.\r\nEnter the appropriate group name.\r\nRepeat to get three age groups as shown in Figure 12 > OK.\r\nFigure 15. Create Calculated FieldThe current value that we have for Resident Labour Force is absolute value, but we are interested in the distribution of age in the workforce. We can get this value by doing a quick table calculation or creating calculated field. This post will use the latter method.We need to create two calculated fields: Total Resident Labour Force and Percentage of Total Resident Labour Force.\r\nRight-click on the Resident Labour Force column header > Create Calculated Field…\r\nFigure 16. Total Resident Labour Force FormulaThe formula shown above calculates the total number of people in the Resident Labour Force per year.\r\nEnter formula shown in Figure 14.\r\nEnter calculated field name name (I used ’Total Resident Labour Force).\r\nRepeat for Percentage of Total Resident Labour Force field using the following formula:\r\n\r\n[Resident Labour Force]/[Total Resident Labour Force]\r\n\r\nFigure 17. Go to SheetWe are done! We can go to the Sheet1 Tab in the bottom left-hand corner.\r\nCreating Visualisation\r\nSheet is where we can build visualisation. The general layout in Tableau interface is shown in Figure 16.\r\nFigure 18. Tableau LayoutWe can build visualisation by dragging the fields from the data pane directly to the canvast or to the shelves. Depending on where we drop the fields, they will take on different roles in the visualisation. To create the line chart for the Resident Labour Force by age group, we will drag the following fields to the column.\r\nFigure 19. Rows and Columns for Line ChartDrag Year to Columns shelf.\r\nDrag % of Total Resident Labour Force to Rows shelf.\r\nNotice that Tableau automatically recommends a line chart to visualise our data. Don’t be alarmed that it is only displaying a straight line. Right now it computes the total percentage of all group, that is why it is always 100%. Next, we need to separate the age groups.\r\nFigure 20. Add Age GroupDrag Age (group) to the Color Marks Card.\r\nCustomisation\r\nWe can further customise the chart appearance to enhance the usefulness and readability of the chart. There are several customisations on the line chart that we are going to perform.\r\nLabel\r\nFigure 21. Add LabelDrag % of Total Resident Labour Force to the Text Marks Card.\r\nDouble-click on Text Marks Card to open the settings.\r\nSelect Line Ends to make the labels only appear on the line end. Otherwise, the chart will be too cluttered.\r\nFigure 22. Format LabelRight-click on one of the labels > Format… to open the Format Pane.\r\nClick on Fields on the top right-hand corner of the Format Pane and click SUM(% of Total Resident Labour Force) that we used for the label.\r\nClick Numbers > Percentage to display the number in percentage form instead of decimal points.\r\nAxis / Header\r\nAs we have already labeled the data points of interest, the y-axis is no longer necessary. We can remove the axis to increase our data-ink ratio.\r\nFigure 23. Remove AxisRight-click on the y-axis > Uncheck Show Header.\r\nFigure 24. Hide Field Labels for ColumnsLikewise, right-click on Year header on the top of the chart > Hide Field Labels for columns because the year is already quite self-explanatory.\r\nLine Markers\r\nFigure 25. Add MarkersClick on Color Marks Card and select All markers which is the middle option. This will make it easier to see the individual data points.\r\nTitle\r\nOur current default title is the sheet name, which is Sheet 1. We can change the sheet name, and further tailor the title to make it more informative.\r\nFigure 26. Rename Sheet NamePretty self-explanatory. Double-click on the Sheet 1 Tab below, then we can type in the desired name. I put ‘Singapore Resident Labour Force by Age Group’.\r\nFigure 27. Change Sheet TitleDouble-click on the sheet title.\r\nWrite the desired title. We can also adjust the font size and formatting.\r\n‘’ means the value is dynamic. Whenever the sheet name changes, the title will follow accordingly. We can also add other variables by clicking Insert. However, we are not adding other variables now.\r\nAnnotations\r\nWe can also annotate on the chart itself to highlight interesting findings.\r\nFigure 28. Annotate MarkRight-click on one of the data point > Annotate > Mark….\r\nFigure 29. AnnotationAdd findings that we want to highlight.\r\nJust like the sheet title, we can customise the annotation and make use of the variables using the Insert button. And now, we are done for this line chart! We can adjust the width and height of the chart by hovering to the right side or below the chart until our cursor turns into a double-sided arrow and drag accordingly.\r\nFigure 30. Final Look for Singapore Resident Labour Force Line Chart4.3. Labour Force Participation Rate Bar Chart\r\nNext, the statement mentions that the increase in older residents in Singapore Labour Force is due to the rise in Labour Force Participation Rate for older residents. We are going to visualise this data to support the statement. Some steps are the same as what was explained in the previous section.\r\nData Preparation\r\nFigure 29. Add New Data SourceGo back to the Data Source tab.\r\nClick the database icon (cylinder) next to the data source name > New Data Source .\r\nChoose the file type > select the file (Table 5 from Labour Force Report 2019).\r\nDrag the T5_T table.\r\nCheck Use Data Interpreter.\r\nHide the first column (F1).\r\nFigure 31. Add FiltersIf we scroll down and see the bottom of the data table, we can see that they have already grouped the age. Therefore, we can filter out the 5-year age bins on the top.\r\nClick Add below the word Filters on the top right-hand corner of the screen > Add.\r\nSelect the Age field (shown as Age(Years) 1 in my Tableau) > OK.\r\nOnly keep 15 - 24, 24 - 54, 55 - 64, and 65 & Over age groups.\r\nGroup the 55 - 64 and 65 & Over groups together and give 55 & Over as the group name.\r\nFigure 32. Live ConnectionThe spacing seem to be very wide for the age groups. Since we are using a live connection, any update on the data source will be reflected in Tableau. I opened the Excel file to manually fix the spacing.\r\nFigure 33. Labour Force Participation Rate Percentage Change FormulaAlthough this data is also in a wide format, we only need the difference between 2019 and 2009 data. We do not need to pivot the table, but we need to create a calculated field for the difference.\r\nRight0click on 2019 column > Create Calculated Field…\r\nEnter the formula shown in Figure 31.\r\nFigure 34. Add New WorksheetWe are done preparing the data. Now we can create the second chart on a new worksheet.\r\nClick on the New Worksheet icon. It is the tab directly next to our line chart tab.\r\nCreate Visualisation\r\nFigure 35. Rows and Columns for Labour Force Participation Rate Bar ChartFor the bar chart, we want to have 3 bars that show the change of Labour Force Participation Rate between 2009 and 2019.\r\nDrag Age group field to the Columns shelf.\r\nDrag Labour Force Participation Rate % Change field to the Rows shelf.\r\nCustomisation\r\nFirst, we are going to add the colour and label to make the bar chart easier to see.\r\nFigure 36. Add Colour and LabelDrag Labour Force Participation Rate % Change field to Color and Label Marks Card\r\nColour\r\nIf we see the color legend on the right, we can see that the range does not start from 0, it only uses the smallest and the biggest value. The purpose of changing the colour to to quickly highlight the positive and negative values as well as showing the significance of the change. Colour is a pre-attentive attribute, so we can quickly notice the difference in colour.\r\nFigure 37. Change ColourDouble-click on the colour legend.\r\nChoose Orange-Blue Diverging palette.\r\nSelect Use Full Color Range.\r\nClick Advanced.\r\nSet the color so it will diverge from the Center at 0.\r\nThe colour of the bars may not change now because all the values are positive. It is okay.\r\nLabel\r\nEven though the Labour Force Participation Rate % Change is a percentage, the number is not between 0 and 1. Therefore, we will use a slightly different method to display the ‘%’ sign.\r\nFigure 38. Customise LabelOpen the format pane like how we did it for the line chart.\r\nChange the Fields to SUM(Labour Force Participation Rate % Change)\r\nChoose Numbers > Numbers (Custom)\r\nReduce the Decimal places to 1\r\nAdd % in the Suffix\r\nNow that the bar is labeled, we can take away the unnecessary axis and headers using the same steps as in the previous section. Remember to rename the sheet name and put a proper title.\r\nFigure 39. Final Look for Labour Force Participation Rate Change4.4. Population Size Change Bar Chart\r\nThe steps to create the Population Size Change Bar Chart is exactly the same as the Labour Force, except we are using a different dataset and we are not displaying ‘%’ sign in the suffix.\r\nFigure 40. Final Look for Population Size Change Bar Chart4.5. Dashboard\r\nNow, it is time to combine the various charts that we have created.\r\nFigure 41. New DashboardTo create new dashboard, click the New Dashboard Tab, which is the second tab to the right of our last worksheet.\r\nFigure 42. Dashboard SizeAdjust the Size to your preference. Automatic means the size will adjust according to the device, but I found that using Automatic can cause problems in the alignment. I chose Desktop Browser(1000x800)\r\nFigure 43. Insert Sheet to DashboardTo add sheet to the dashboard drag the sheet name to the canvas.\r\nHold and hover around the dashboard to see a highlighted box, that will be the space that the sheet take up if we release our mouse.\r\nBy default, Tableau uses a Tiled layout. To better arrange our sheet, we can make use of the objects.\r\nFigure 44. Vertical ObjectVertical object allows us to have a vertical grid that we an fill in with sheets or another objects.\r\nDrag Vertical Object to the canvas.\r\nClick on the sheet that we already put to the dashboard.\r\nHover to the grey rectangle above the sheet until it turns to a four-sided arrow\r\nDrag the sheet into the vertical object\r\nSimilarly, we can use blank to add paddings around the objects (such as to align the sheets), add horizontal grid, text, etc.\r\nFigure 45. Remove LegendSince we have annotated the line chart and the colour in the bar charts are to highlight positive and negative values, the legends are not necessary.\r\nClick on the legend.\r\nClick on the cross to remove from the dashboard.\r\nFigure 46. Show Dashboard TitleTo create a title and lead-in for the dashboard, we can either use a Text object or use the dashboard title itself. The Show dashboard title checkbox highlighted in Figure 45 will make the dashboard title appear.\r\nFigure 47. Final Dashboard LayoutThe final dashboard that I created is shown in Figure 46, marked with colour-coded rectangles to show what object I used to arrange them.\r\nCongratulations, we have completed our dashboard!\r\n5. Major Observations\r\nFigure 48. Singapore Resident Labour Force Alternative Graphical RepresentationDue to the rapidly rising population size of older residents, having more older residents in the workforce is natural, or even preferable. As the distribution of population is getting more and more skewed, Singapore’s old-age support ratio will continue to decrease. Old-age support ratio is the number of people who are financially productive compared to the number of older people who may be dependent on others’ support (Singapore Department of Statistics). The increase of Labour Force Participation Rate in older residents helps to reduce the number of older residents that depend on others’ support.\r\nThe increase in population size in 55 & Over age group is incomparable to the decrease in population size of 25 - 54 age group. This means that the majority of people in the 55 & Over age group in 2009 are still alive in 2019, which can be attributed to Singapore’s excellent healthcare system. We will continue to see rising number of older residents in the workforce before the ratio will reach an equilibrium as long as the population size of younger residents does not continue to decline.\r\nAs the increase in Labour Force Participation Rate is not as high in 15 - 24 and 25 - 54 age groups compared to the 55 & Over age group, another way to sustain the old-age support ratio is to increase the Labour Force Participation Rate in the younger residents. Non-working residents in the younger age groups are most likely students or stay-at-home mother. Finding out the reason they choose not to participate in the labour force is a necessary step if we want to encourage them to enter the workforce.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-29-dataviz-makeover-1/./images/Final Dashboard.png",
    "last_modified": "2021-02-28T19:12:04+08:00",
    "input_file": {},
    "preview_width": 1000,
    "preview_height": 795
  }
]
