[
  {
    "path": "posts/welcome/",
    "title": "Welcome to Visual Analytics",
    "description": "Welcome to my new blog, Visual Analytics. I hope you enjoy \nreading!",
    "author": [
      {
        "name": "Gabriella Pauline Djojosaputro",
        "url": "https://github.com/gabriellapauline"
      }
    ],
    "date": "2021-01-29",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-31T11:12:13+08:00",
    "input_file": "welcome.utf8.md"
  },
  {
    "path": "posts/2021-01-29-dataviz-makeover-1/",
    "title": "DataViz Makeover 1",
    "description": "A data visualization makeover",
    "author": [
      {
        "name": "Gabriella Pauline Djojosaputro",
        "url": "https://example.com/norajones"
      }
    ],
    "date": "2021-01-29",
    "categories": [],
    "contents": "\r\n1. Introduction\r\nWe are living in a world that is constantly producing a vast amount of data, and data visualisation helps us to understand the data better. However, a poor visualisation can be of little value, or even misleading. Visual analytics is not just about creating a pretty chart, but it is the marriage of data analytics and visualizations that aims to detect the expected and discover the unexpected.\r\nThis post will makeover Chart 6: Resident Labour Force by age group from page 22 of Labour Force in Singapore 2019 Report.\r\n2. Original Visualization\r\nTo start, we examine the original visualisation from the data (Figure 1) to learn what we can improve. The critique is given in terms of clarity and aesthetics.\r\nFigure 1. Original chart from Labour Force in Singapore 2019 Report2.1 Clarity:\r\nPoor choice of chart gives the impression that they are comparing the distribution of age in two categories, for example the age distribution in male and female residents. To represent how values change over time, line chart is a better choice than histogram.\r\nIt is difficult to see the values of the data points in the chart. The graph does not have axis and thus we need to depend on the labels to see the actual value of each data point. However, these labels are put below the chart as a table, and not on the chart itself.\r\nThere is an inconsistency between the statement and the chart. While the statement mentions a decline in 25 - 54 age group as well as an increase in 55 & over age group, the readers are not able to find the values on the chart itself. These are a summation of multiple categories from the chart and the readers must manually sum the numbers together to get the the values mentioned in the statement.\r\nThe statement mentioned rise of Labour Force Participation Rate (LFPR) and population size per age group, but the chart also does not have any reference to LFPR or population size per age group.\r\n2.2 Aesthetics:\r\nThe chart is not exported in good quality. It is quite pixelated, even in the original report.\r\nUsing a very short subtitle ‘Per Cent’ creates an awkward empty space above the chart. It would be better to add it to the title, or omit the subtitle altogether.\r\nAlthough the report uses a white background, the chart has a grey background colour. Background colour is an unnecessary non data-ink which does not add value in helping to understand the data better.\r\n3. Alternative Graphical Representation\r\nFigure 2 shows the alternative graphical representation proposed for the makeover.\r\nFigure 2. Alternative Graphical RepresentationThe issues that the alternative design tries to overcome are:\r\nTo clearly show the difference of workforce distribution over time by the use of line chart instead of histogram.\r\nTo further categorise the age groups together to the same level as the point of interest in the statement, so that the readers can see the value directly without having to calculate the total from different subgroups.\r\nTo show the LFPR and population size per age group. This alternative representation will directly show the difference between 2019 and 2009 values instead of showing another line charts because they are just additional information.\r\nTo remove unnecessary non-data-ink by using a white background (Note: The colour on the proposed design is from the paper, which is not going to be used in the final chart).\r\n4. Step-by-Step Description\r\n4.1 Data Source\r\nThere is no visualisation and analytics if there is no data. The data that will be used are:\r\nNo\r\nData\r\nSource\r\n1.\r\nResident Labour Force by Age\r\nLabour Force 2019 Report, Table 7\r\n2.\r\nLabour Force Participation Rate by Age\r\nLabour Force 2019 Report, Table 5\r\n3.\r\nPopulation Size by Age\r\nSingapore Department of Statistics\r\n4.2 Resident Labour Force Line Chart\r\nThis chart will show how percentage of each age groups of interest in the Resident Labour Force changes through the course of 2009 to 2019. Steps to create the visualisation is shown below.\r\nData Preparation\r\nFigure 3. Connect to DataCreate a new workbook and click Connect to Data.\r\nChoose the data source (In this case, it would be Table 7 from Labour Force Report 2019).\r\n! Figure 4. Add Table\r\nDrag the table that we want to the workspace. We are interested in the total number, not in the distribution of gender. Therefore, we can use T7_T that contains the total number of males and females.\r\nCheck the Use Data Interpreter checkbox to allow Tableau to do automatic cleaning. Tableau is able to intelligently detect valuable columns and rows, and drop the empty ones.\r\nFigure 5. Hide ColumnAfter the cleaning, we still have a column that we are not interested in. There are some values in the column, but it is just an annotation.\r\nHover to the column header that we want to hide.\r\nClick the grey inverted triangle > Hide\r\nThe first row in the table has null in the Age column. This value is the total from all Age groups, which we can obtain with the SUM function later. We can filter out this row.\r\nFigure 6. Add FiltersIn the top right-hand corner, under Filters, click Add.\r\nClick Add again in the Edit Data Source Filters window\r\nSelect the Age field > OK\r\nFigure 7. Select AgeWe can either select None and manually check the data items we want one-by-one, or check all boxes first and unselect the one we do not want. Since we only want to remove one age group, we will do the latter.\r\nSelect All.\r\nUncheck the Null box > OK\r\nThe table is currently in a wide format, but we want it to be long and thin so we can assign the years as a Date variable. We can use the pivot function from Tableau.\r\nFigure 8. PivotSelect all the columns with the year as the header column. We can do this by holding Ctrl button while selecting the columns or holding Shift button and select the first (2009) and last (2019) column that we want.\r\nRight-click on any of the column header > Pivot\r\nFigure 9. Rename ColumnsThe data is now transformed to a thin table with three columns. The original column headers are stored in Pivot Field Names, while the values are stored in Pivot Field Values. Rename the columns to make it easier to understand.\r\nRight-click on the column header > Rename\r\nThe original and new column names are shown below.\r\nOriginal Column Name\r\nNew Column Name\r\nPivot Field Names\r\nYear\r\nPivot Field Values\r\nResident Labour Force\r\nAge (Years) 2\r\nAge\r\nFigure 10. Change to DateNotice that there is an ‘Abc’ symbol above the column Age and Year. This means the two variables are considered String Variables. However, we want the Year to have a Date data type. * Click the ‘Abc’ symbol in Year column header > Date\r\nFigure 11. Create GroupNext, one of the improvement we want to make on the original visualisation is to group the age variable so it will be the same as the age groups that are mentioned in the statement. Therefore, we need to group into 25 - 54 and 55 & over. Age group 15 - 24 will be created even though it is not mentioned in the statement to show that the numbers sum to 100%.\r\nRight-click on Age column header > Create group…\r\nFigure 12. Age GroupsSelect the ages that we want to group together (e.g. 15 - 19 and 20 - 24), then press Group\r\nEnter the appropriate group name\r\nRepeat to get three age groups as shown in Figure 12 > OK\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-02-01T18:46:52+08:00",
    "input_file": "dataviz-makeover-1.utf8.md"
  }
]
